# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, LSKNet, [64, [3, 4, 6, 3]]]   # 0 -> [P5, P4, P3]
  - [-1, 1, IndexSelector, [[0]]]                  # 1: P5 (32x)
  - [-2, 1, IndexSelector, [[1]]]                  # 2: P4 (16x)
  - [-3, 1, IndexSelector, [[2]]]                  # 3: P3 (8x)

head:
  # 从 P5 开始上采样，与 P4 融合
  - [1, 1, nn.Upsample, [None, 2, "nearest"]]          # 4
  - [[-1, 2], 1, Concat, [1]]                           # 5 cat (P5_up + P4)
  - [-1, 2, C3k2, [512, False]]                         # 6
  # 从 F4 上采样，与 P3 融合
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 7
  - [[-1, 3], 1, Concat, [1]]                           # 8 cat (F4_up + P3)
  - [-1, 2, C3k2, [256, False]]                         # 9 (P3/8-small)
  # 下采样分支
  - [-1, 1, Conv, [256, 3, 2]]                          # 10
  - [[-1, 6], 1, Concat, [1]]                           # 11 cat (10 + F4)
  - [-1, 2, C3k2, [512, False]]                         # 12 (P4/16-medium)
  - [-1, 1, Conv, [512, 3, 2]]                          # 13
  - [[-1, 1], 1, Concat, [1]]                           # 14 cat (13 + P5)
  - [-1, 2, C3k2, [1024, True]]                         # 15 (P5/32-large)
  - [[9, 12, 15], 1, Detect, [nc]]                      # 16