# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 with ASGF Neck (Adaptive Spatial-Global Fusion)
# 结合 ASFF 空间自适应权重 + Gold-YOLO 全局上下文

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11 ASGF head
head:
  # ASGF Neck: 接收 P3/P4/P5，输出 P3/P4/P5
  # 参数: [channels, out_channels, num_asgf_layers, use_global]
  - [[2, 4, 6, 9, 10], 1, ASGFNeck, [[256, 512, 512, 1024, 1024], [128, 256, 512], 1, True]]

  # 检测头 (P3/P4/P5)
  - [[11], 1, Detect, [nc]]
