# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11-test with DWC3k2 in neck (depthwise separable conv replaces C3k2)
# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, LogWaveletDenoise, [64,3,2]] # 0-P1/2
  - [-1, 1, Conv, [128,3,2]] # 1-P2/4
  - [-1, 2, C3k2, [128, True,]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [256, True,]]
  - [-1, 1, Conv, [512,3,2]] # 5-P4/16
  - [-1, 2, SoftFillEdgeEnhance, [512]]           # P4: self-developed edge enhancement
  - [-1, 1, nn.Identity, []]
  - [-1, 1, nn.Identity, [ ] ]
  - [-1, 1, SPPF, [512, 5]] # 9
  - [-1, 2, C2PSA, [512]] # 10

# YOLO11n head (DWC3k2 replaces C3k2 in neck)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [ 1 ]] # cat backbone P3
  - [-1, 2, DWC3k2, [ 256, False ]] # 13 (P3/8-small) DWC3k2

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [ [ -1, 2 ], 1, Concat, [ 1 ] ] # cat backbone P2
  - [ -1, 2, DWC3k2, [ 128, False ] ] # 16 (P2/4-xsmall) DWC3k2

  - [ -1, 1, Conv, [ 256, 3, 2 ] ]
  - [ [ -1, 13 ], 1, Concat, [ 1 ] ] # cat head P3
  - [ -1, 2, DWC3k2, [ 256, False ] ] # 19 (P3/8-small) DWC3k2

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P4
  - [-1, 2, DWC3k2, [ 512, False]] # 22 (P4/16-medium) DWC3k2

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P2, P3, P4)