# Ultralytics AGPL-3.0 License
# WEF-YOLO ablation variant.
# Baseline = YOLO11s + P2 head - P5 stage.  Modules: W=LWDS(stem)  E=SFEE(P4)  F=WRF(neck).
# This variant: W=off E=on F=off  (num_wrf_layers=0)
# Train at scale s:  YOLO('yolo11s-ablation-<flags>.yaml')   (file stored without the 's')

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                 # 0-P1/2  stem (Conv baseline)
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, SoftFillEdgeEnhance, [512]]            # 6 P4 feature (SFEE)
  - [-1, 1, nn.Identity, []]            # 7
  - [-1, 1, nn.Identity, []]            # 8
  - [-1, 1, SPPF, [512, 5]]             # 9
  - [-1, 2, C2PSA, [512]]               # 10

head:
  - [[2, 4, 10], 1, FPN_PAN_WRF, [ [256, 512, 512], [128, 256, 512], 0, False]] # 11 neck: FPN-PAN + WRF x0
  - [11, 1, SplitList, [128, 0]]        # 12 P2_out
  - [11, 1, SplitList, [256, 1]]        # 13 P3_out
  - [11, 1, SplitList, [512, 2]]        # 14 P4_out
  - [[12, 13, 14], 1, Detect, [nc]]
