# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, WaveletStem, [128] ] # 0
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, Conv, [256, 3, 2]] # 2-P3/8
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, Conv, [512, 3, 2]] # 4-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, HIPA, [512, 5, 0.5,[],8, True, 16, 'center', True, 'l2']] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [ -1, 1, nn.Identity, [ ] ]
  - [-1, 1, HIPA, [1024, 4, 0.25,[],8, True, 16, 'center', True, 'l2']] # 10

# YOLO11n head
head:
  - [[3, 6, 10], 1, BiFPN, [[512, 512, 1024]]]  # 输入来自 Backbone P5, P4, P3
  - [11, 1, SplitList, [256,0]]
  - [11, 1, SplitList, [512,1]]
  - [11, 1, SplitList, [1024,2]]
  - [[12, 13 ,14], 1, Detect, [nc]] # Detect(P3, P4, P5)

